 
 gcc -g p4original.c
 ./a.out
enter a number
55
enter a number
88
enter a number
67
b is largest among 55,88 and 67 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x886: file p4original.c, line 33.
(gdb) r
Starting program: /home/runner/pps-test1-Vpt03-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4original.c:33
warning: Source file is more recent than executable.
33    a = input();
(gdb) s
input () at p4original.c:4
4   {
(gdb) n
6     printf("enter a number\n");
(gdb) n
enter a number
7     scanf("%d",&a);
(gdb) n
n
8     return a;
(gdb) n
9   }
(gdb) s
main () at p4original.c:34
34    b = input();
(gdb) n
enter a number
35    c = input();
(gdb) n
enter a number
36    largest = cmp(a,b,c,largest);
(gdb) n
37    output(a,b,c,largest);
(gdb) n
38    return 0;
(gdb) n
39  }(gdb) s
__libc_start_main (main=0x555b92c0087e <main>, argc=1, argv=0x7ffe8bfd0978, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffe8bfd0968) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p a
No symbol "a" in current context.
(gdb) p int a
A syntax error in expression, near `a'.
(gdb) p int aQuit
A syntax error in expression, near `aQuit'.
(gdb) quit
A debugging session is active.

    Inferior 1 [process 403] will be killed.

Quit anyway? (y or n) y
 